In [1]:
import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [87]:
df1 = pd.read_csv('Data/Train.csv',encoding="ISO-8859-1")

#country = pd.read_excel('Country-Code.xlsx')
#country.head()
df1.shape
df1.isnull().sum()
#df1=df1.dropna()
df1.isnull().sum()
#df1.shape
df1.groupby('room_type').sum()

,id,host_id,latitude,longitude,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
room_type,,,,,,,,,,
Entire home/apt,328211869197,1099364091379,726151.71622,-1.318642e+06,3800708,151227,409182,18848.18,189119,1996283
Private room,302862084674,1122477674721,635133.46908,-1.153065e+06,1394423,81400,378587,17797.86,49994,1751766
Shared room,18606898786,82884688868,32707.57288,-5.937683e+04,57909,5370,12809,870.97,3683,129816

In [ ]:
#data = df.merge(country,on='Country Code')
#data.head()
#data.shape

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34226 entries, 0 to 34225
Data columns (total 16 columns):
id                                34226 non-null int64
name                              34214 non-null object
host_id                           34226 non-null int64
host_name                         34213 non-null object
neighbourhood_group               34226 non-null object
neighbourhood                     34226 non-null object
latitude                          34226 non-null float64
longitude                         34226 non-null float64
room_type                         34226 non-null object
price                             34226 non-null int64
minimum_nights                    34226 non-null int64
number_of_reviews                 34226 non-null int64
last_review                       27244 non-null object
reviews_per_month                 27244 non-null float64
calculated_host_listings_count    34226 non-null int64
availability_365                  34226 non-null int64
dtypes: float64(3), int64(7), object(6)
memory usage: 4.2+ MB

In [4]:
df1.describe()

,id,host_id,latitude,longitude,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
count,3.422600e+04,3.422600e+04,34226.000000,34226.000000,34226.000000,34226.000000,34226.000000,27244.000000,34226.000000,34226.000000
mean,1.898209e+07,6.733847e+07,40.729059,-73.952070,153.480979,6.953690,23.390931,1.377074,7.093905,113.301730
std,1.097597e+07,7.833091e+07,0.054604,0.046161,243.312608,20.255833,44.476822,1.688953,32.828412,131.892814
min,2.595000e+03,2.438000e+03,40.499790,-74.244420,0.000000,1.000000,0.000000,0.010000,1.000000,0.000000
25%,9.460366e+06,7.824440e+06,40.690040,-73.983150,69.000000,1.000000,1.000000,0.190000,1.000000,0.000000
50%,1.965371e+07,3.065628e+07,40.722995,-73.955700,107.000000,2.000000,5.000000,0.730000,1.000000,45.000000
75%,2.908201e+07,1.074344e+08,40.763200,-73.935982,175.000000,5.000000,24.000000,2.020000,2.000000,229.000000
max,3.648724e+07,2.743115e+08,40.913060,-73.712990,10000.000000,1250.000000,629.000000,58.500000,327.000000,365.000000

In [79]:
df1['name'].isnull().sum()

12

In [74]:
df1['host_name'].value_counts()
df11 = df1[ df1['host_name']=='Rosie']
df12 = df11[ df11['host_id']==7245581]
df11[['latitude', 'longitude', 'price']].sort_values('price', ascending=False).head(100)

       latitude  longitude  price
23575  40.72259  -73.99311    200
2351   40.73525  -73.98074    150
10671  40.68279  -73.92135    120
7575   40.69474  -73.96655    100
17882  40.70696  -73.91990     50

In [76]:
from math import sin, cos, sqrt, atan2, radians

# approximate radius of earth in km
R = 6373.0

lat1 = radians(40.70844)
lon1 = radians(74.00615)
lat2 = radians(40.70724)
lon2 = radians(74.00614)

dlon = lon2 - lon1
dlat = lat2 - lat1

a = sin(dlat / 2)**2 + cos(lat1) * cos(lat2) * sin(dlon / 2)**2
c = 2 * atan2(sqrt(a), sqrt(1 - a))

distance = R * c

print("Result:", distance*1000)

('Result:', 133.47846302651442)

In [75]:
df2 = df1[ df1['room_type']=='Entire home/apt']

df3 = df2[ df2['neighbourhood_group']=='Manhattan']

df4 = df3[ df3['host_name']=='Sonder (NYC)']

df4['price'].value_counts()

#df3=df2[df2['neighbourhood']=='Richmondtown']

df4[['latitude', 'longitude','host_id', 'price']].sort_values('price', ascending=False).head(10)
#df3['host_name'].value_counts()

       latitude  longitude    host_id  price
3147   40.70844  -74.00615  219517861    699
9051   40.70724  -74.00614  219517861    699
10659  40.70840  -74.00518  219517861    699
24416  40.75969  -73.98732  219517861    699
2002   40.70707  -74.00557  219517861    699
28005  40.75942  -73.98727  219517861    699
24181  40.70645  -74.01186  219517861    520
20300  40.70631  -74.01098  219517861    503
95     40.70645  -74.01203  219517861    503
22128  40.70620  -74.01192  219517861    498

In [ ]:
data['Country'].value_counts()

In [ ]:
data['Country'].value_counts(normalize=True)

In [ ]:
data.drop_duplicates(subset=['Restaurant Name','Country','City','Locality'],inplace=True)
data.shape

In [ ]:
countries = data['Country'].value_counts().index
countries

In [ ]:
countries = data['Country'].value_counts().index
no_of_restaurants = data['Country'].value_counts()
plt.figure(figsize=(15,10))
plt.bar(countries,no_of_restaurants)
plt.xlabel('Country',fontsize=20)
plt.ylabel('No of Restaurants',fontsize=20)
plt.title('No of Restaurants',fontsize=20,color='navy')
for idx,num in enumerate(no_of_restaurants):
    plt.text(idx-0.3,num+30,s=str(num),color='red')
plt.xticks(rotation=60)
plt.show()

In [ ]:
data.pivot_table(index=['Country', 'City'], values = 'Restaurant ID',aggfunc='count').sort_values('Restaurant ID',ascending=False)
data.pivot_table(index=['Country', 'City'], values = 'Votes',aggfunc='count').sort_values('Votes',ascending=False)
#data[data['Country'] != 'India'].pivot_table(index=['Country', 'City'],values = 'Restaurant ID',aggfunc='count').sort_values('Restaurant ID',ascending=False)

In [ ]:
data_city=data[data['Country']=='India']
#data_city.head()
Total_city=data_city['City'].value_counts()
#Total_city
Total_city.plot.bar(figsize=(15,10),fontsize=20)

In [ ]:
data[data['Country']=='India']['City'].value_counts(normalize=True).plot(kind='bar',figsize=(15,7))

In [ ]:
data_online_delivary=data[data['Country']=='United States']
data_online_delivary.head()
data_online_delivary['Has Online delivery'].value_counts().plot(kind='bar',figsize=(15,7))

In [ ]:
fig=plt.figure(figsize=(15,7))
sns.barplot(data['Cuisines'].value_counts().index[:15],data['Cuisines'].value_counts()[:15])
plt.xlabel('Cuisines',fontsize=20)
plt.ylabel('No of Restaurants',fontsize=20)
plt.title('Top 15 Restaurants',fontsize=30)
plt.xticks(rotation=90)

In [ ]:
cuisines = ['Noth Indian', 'Fast Food', 'Chinese']
data_small = data[data['Cuisines'].isin(cuisines)]
data_small.head()
#sns.catplot(x='Cuisines', col='Country', col_wrap=3, kind='count', data=data_small.dropna(),sharey=False)

# Pandas Profiling

In [ ]:
#from pandas_profiling import ProfileReport
#profile = ProfileReport(data,title='Pandas Profiling Report')
#profile
# unable to install pandas_profiling in office Pc

# Average ratings of countries

In [ ]:
data.groupby('Country')['Aggregate rating'].mean()

In [ ]:
data_india = data[data['Country']=='India']
data_india.groupby('City')['Aggregate rating'].mean()

In [ ]:
country_average=data.groupby('Country')['Aggregate rating'].mean().reset_index()
fig=plt.figure(figsize=(15,7))
plt.bar(country_average['Country'],country_average['Aggregate rating'] )
plt.xticks(rotation=60)
plt.show()